ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_result_regs.xml
<module id="ADC_RESULT_REGS" HW_revision="" description="ADC RESULT Registers">
	<register id="ADCRESULT0" width="16" page="0" offset="0x0" instances="1" instaddr="2" internal="0" description="ADC Result 0 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT1" width="16" page="0" offset="0x2" instances="1" instaddr="2" internal="0" description="ADC Result 1 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT2" width="16" page="0" offset="0x4" instances="1" instaddr="2" internal="0" description="ADC Result 2 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT3" width="16" page="0" offset="0x6" instances="1" instaddr="2" internal="0" description="ADC Result 3 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT4" width="16" page="0" offset="0x8" instances="1" instaddr="2" internal="0" description="ADC Result 4 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT5" width="16" page="0" offset="0xa" instances="1" instaddr="2" internal="0" description="ADC Result 5 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT6" width="16" page="0" offset="0xc" instances="1" instaddr="2" internal="0" description="ADC Result 6 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT7" width="16" page="0" offset="0xe" instances="1" instaddr="2" internal="0" description="ADC Result 7 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT8" width="16" page="0" offset="0x10" instances="1" instaddr="2" internal="0" description="ADC Result 8 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT9" width="16" page="0" offset="0x12" instances="1" instaddr="2" internal="0" description="ADC Result 9 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT10" width="16" page="0" offset="0x14" instances="1" instaddr="2" internal="0" description="ADC Result 10 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT11" width="16" page="0" offset="0x16" instances="1" instaddr="2" internal="0" description="ADC Result 11 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT12" width="16" page="0" offset="0x18" instances="1" instaddr="2" internal="0" description="ADC Result 12 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT13" width="16" page="0" offset="0x1a" instances="1" instaddr="2" internal="0" description="ADC Result 13 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT14" width="16" page="0" offset="0x1c" instances="1" instaddr="2" internal="0" description="ADC Result 14 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT15" width="16" page="0" offset="0x1e" instances="1" instaddr="2" internal="0" description="ADC Result 15 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT16" width="16" page="0" offset="0x20" instances="1" instaddr="2" internal="0" description="ADC Result 16 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT17" width="16" page="0" offset="0x22" instances="1" instaddr="2" internal="0" description="ADC Result 17 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT18" width="16" page="0" offset="0x24" instances="1" instaddr="2" internal="0" description="ADC Result 18 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT19" width="16" page="0" offset="0x26" instances="1" instaddr="2" internal="0" description="ADC Result 19 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT20" width="16" page="0" offset="0x28" instances="1" instaddr="2" internal="0" description="ADC Result 20 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT21" width="16" page="0" offset="0x2a" instances="1" instaddr="2" internal="0" description="ADC Result 21 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT22" width="16" page="0" offset="0x2c" instances="1" instaddr="2" internal="0" description="ADC Result 22 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT23" width="16" page="0" offset="0x2e" instances="1" instaddr="2" internal="0" description="ADC Result 23 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT24" width="16" page="0" offset="0x30" instances="1" instaddr="2" internal="0" description="ADC Result 24 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT25" width="16" page="0" offset="0x32" instances="1" instaddr="2" internal="0" description="ADC Result 25 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT26" width="16" page="0" offset="0x34" instances="1" instaddr="2" internal="0" description="ADC Result 26 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT27" width="16" page="0" offset="0x36" instances="1" instaddr="2" internal="0" description="ADC Result 27 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT28" width="16" page="0" offset="0x38" instances="1" instaddr="2" internal="0" description="ADC Result 28 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT29" width="16" page="0" offset="0x3a" instances="1" instaddr="2" internal="0" description="ADC Result 29 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT30" width="16" page="0" offset="0x3c" instances="1" instaddr="2" internal="0" description="ADC Result 30 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT31" width="16" page="0" offset="0x3e" instances="1" instaddr="2" internal="0" description="ADC Result 31 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB1RESULT" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="ADC Post Processing Block 1 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB2RESULT" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="ADC Post Processing Block 2 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB3RESULT" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="ADC Post Processing Block 3 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB4RESULT" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="ADC Post Processing Block 4 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB1SUM" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="ADC PPB 1 Final Sum Result Register">
		<bitfield id="SUM" description="Post Processing Block 1 Oversampling Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB1COUNT" width="16" page="0" offset="0x54" instances="1" instaddr="2" internal="0" description="ADC PPB1 Final Conversion Count Register">
		<bitfield id="COUNT" description="Post Processing Block 1 Final Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2SUM" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="ADC PPB 2 Final Sum Result Register">
		<bitfield id="SUM" description="Post Processing Block 2 Oversampling Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB2COUNT" width="16" page="0" offset="0x5c" instances="1" instaddr="2" internal="0" description="ADC PPB2 Final Conversion Count Register">
		<bitfield id="COUNT" description="Post Processing Block 2 Final Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3SUM" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="ADC PPB 3 Final Sum Result Register">
		<bitfield id="SUM" description="Post Processing Block 3 Oversampling Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB3COUNT" width="16" page="0" offset="0x64" instances="1" instaddr="2" internal="0" description="ADC PPB3 Final Conversion Count Register">
		<bitfield id="COUNT" description="Post Processing Block 3 Final Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4SUM" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="ADC PPB 4 Final Sum Result Register">
		<bitfield id="SUM" description="Post Processing Block 4 Oversampling Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB4COUNT" width="16" page="0" offset="0x6c" instances="1" instaddr="2" internal="0" description="ADC PPB4 Final Conversion Count Register">
		<bitfield id="COUNT" description="Post Processing Block 4 Final Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB1MAX" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="ADC PPB 1 Final Max Result Register">
		<bitfield id="MAX" description="Post Processing Block 1 Oversampling Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB1MAXI" width="16" page="0" offset="0x74" instances="1" instaddr="2" internal="0" description="ADC PPB 1 Final Max Index Result Register">
		<bitfield id="MAXI" description="Post Processing Block 1 Oversampling Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB1MIN" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="ADC PPB 1 Final Min Result Register">
		<bitfield id="MIN" description="Post Processing Block 1 Oversampling Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB1MINI" width="16" page="0" offset="0x7c" instances="1" instaddr="2" internal="0" description="ADC PPB 1 Final Min Index Result Register">
		<bitfield id="MINI" description="Post Processing Block 1 Oversampling Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2MAX" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="ADC PPB 2 Final Max Result Register">
		<bitfield id="MAX" description="Post Processing Block 2 Oversampling Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB2MAXI" width="16" page="0" offset="0x84" instances="1" instaddr="2" internal="0" description="ADC PPB 2 Final Max Index Result Register">
		<bitfield id="MAXI" description="Post Processing Block 2 Oversampling Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB2MIN" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="ADC PPB 2 Final Min Result Register">
		<bitfield id="MIN" description="Post Processing Block 2 Oversampling Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB2MINI" width="16" page="0" offset="0x8c" instances="1" instaddr="2" internal="0" description="ADC PPB 2 Final Min Index Result Register">
		<bitfield id="MINI" description="Post Processing Block 2 Oversampling Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3MAX" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="ADC PPB 3 Final Max Result Register">
		<bitfield id="MAX" description="Post Processing Block 3 Oversampling Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB3MAXI" width="16" page="0" offset="0x94" instances="1" instaddr="2" internal="0" description="ADC PPB 3 Final Max Index Result Register">
		<bitfield id="MAXI" description="Post Processing Block 3 Oversampling Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3MIN" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="ADC PPB 3 Final Min Result Register">
		<bitfield id="MIN" description="Post Processing Block 3 Oversampling Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB3MINI" width="16" page="0" offset="0x9c" instances="1" instaddr="2" internal="0" description="ADC PPB 3 Final Min Index Result Register">
		<bitfield id="MINI" description="Post Processing Block 3 Oversampling Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4MAX" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="ADC PPB 4 Final Max Result Register">
		<bitfield id="MAX" description="Post Processing Block 4 Oversampling Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB4MAXI" width="16" page="0" offset="0xa4" instances="1" instaddr="2" internal="0" description="ADC PPB 4 Final Max Index Result Register">
		<bitfield id="MAXI" description="Post Processing Block 4 Oversampling Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4MIN" width="32" page="0" offset="0xa8" instances="1" instaddr="4" internal="0" description="ADC PPB 4 Final Min Result Register">
		<bitfield id="MIN" description="Post Processing Block 4 Oversampling Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB4MINI" width="16" page="0" offset="0xac" instances="1" instaddr="2" internal="0" description="ADC PPB 4 Final Min Index Result Register">
		<bitfield id="MINI" description="Post Processing Block 4 Oversampling Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
</module>
